#__author__ = 'vamskazi'
#Напишите программу кот. запрашивает у пользователя два числа, а затем возвращает остаток от деления этих чисел.
print('vvedite pervoe chislo')
a = input()
a = int(a)
print('vvedite vtoroe chislo')
b = input()
b = int(b)

rez = a % b

print('otvet:',rez)